Revit 2015 API
SlabEdgeTypeSet.Insert Method
Insert the specified slab edge type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	SlabEdgeType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As SlabEdgeType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	SlabEdgeType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.SlabEdgeType
The slab edge type to be inserted into the set.
Return Value
Returns whether the slab edge type was inserted into the set.
See Also
SlabEdgeTypeSet Class
Autodesk.Revit.DB Namespace